In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(
     {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df

     A      B         C         D
0  foo    one -0.112599  0.968851
1  bar    one  1.280351  1.272317
2  foo    two -1.762108 -0.677587
3  bar  three  0.903337 -0.996345
4  foo    two  0.045195  0.049300
5  bar    two -0.176156 -1.470362
6  foo    one  0.492506 -0.224509
7  foo  three  0.703143  0.372519

In [3]:
df.groupby("A")[["C", "D"]].sum()

            C         D
A
bar  2.007532 -1.194391
foo -0.633864  0.488574

In [4]:
df.groupby("A").sum()

                     B         C         D
A
bar        onethreetwo  2.007532 -1.194391
foo  onetwotwoonethree -0.633864  0.488574

Reshaping

In [5]:
arrays = [
   ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ["one", "two", "one", "two", "one", "two", "one", "two"],
]

index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])
df2 = df[:4]
df2

                     A         B
first second
bar   one     1.086036  0.060533
      two    -1.344424 -1.476902
baz   one     0.119519  1.425736
      two     0.661000 -0.246307

In [6]:
stacked = df2.stack(future_stack=True)
stacked

first  second
bar    one     A    1.086036
               B    0.060533
       two     A   -1.344424
               B   -1.476902
baz    one     A    0.119519
               B    1.425736
       two     A    0.661000
               B   -0.246307
dtype: float64

In [7]:
stacked.unstack()

                     A         B
first second
bar   one     1.086036  0.060533
      two    -1.344424 -1.476902
baz   one     0.119519  1.425736
      two     0.661000 -0.246307

In [8]:
stacked.unstack(1)

second        one       two
first
bar   A  1.086036 -1.344424
      B  0.060533 -1.476902
baz   A  0.119519  0.661000
      B  1.425736 -0.246307

In [9]:
stacked.unstack(0)

first          bar       baz
second
one    A  1.086036  0.119519
       B  0.060533  1.425736
two    A -1.344424  0.661000
       B -1.476902 -0.246307

Pivot tables

In [10]:
df = pd.DataFrame(
     {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)
df

        A  B    C         D         E
0     one  A  foo  0.191135 -0.550101
1     one  B  foo  0.843607 -0.371582
2     two  C  foo -2.023459 -0.530278
3   three  A  bar -0.732730 -0.408407
4     one  B  bar  0.456166 -2.089245
5     one  C  bar -0.421045  0.046016
6     two  A  foo  0.358301 -0.706591
7   three  B  foo -0.489342 -1.149372
8     one  C  foo -2.049206 -2.104105
9     one  A  bar  2.788449  0.767629
10    two  B  bar -0.361964  2.127194
11  three  C  bar -0.306062  1.189268

In [11]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A  2.788449  0.191135
      B  0.456166  0.843607
      C -0.421045 -2.049206
three A -0.732730       NaN
      B       NaN -0.489342
      C -0.306062       NaN
two   A       NaN  0.358301
      B -0.361964       NaN
      C       NaN -2.023459